DATA SEGMENT

        IOY0_A		equ	0600h
        IOY0_B		equ	0602h
	IOY0_C		equ	0604h
	IOY0_D		equ	0606h

	IOY1_A		equ	0640h
	IOY1_B		equ	0642h
	IOY1_C		equ	0644h
	IOY1_D		equ	0646h

	IOY2_A		equ	0680h
	IOY2_B		equ	0682h
	IOY2_C		equ	0684h
	IOY2_D		equ	0686h

	IOY3_A		equ	06C0h
	IOY3_B		equ	06C2h
	IOY3_C		equ	06C4h
	IOY3_D		equ	06C6h

;;;;;;;;;;;;;;;;;;实验9的;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

NUMBER DB 3FH,00H,00H,00H,00H,00H             ;;;;;数码管显示值的缓冲区，初始显示0

LEDTAB DB  3FH	;0的段码
       DB  06H	;1
       DB  5BH	;2
       DB  4FH	;3
       DB  66H	;4
       DB  6DH	;5
       DB  7DH	;6
       DB  07H	;7
       DB  7FH	;8
       DB  6FH	;9
       DB  77H	;A
       DB  7CH  ;B
       DB  39H	;C
       DB  5EH	;D
       DB  79H	;E
       DB  71H	;F


;;;;;;;;;;;;;;;;;;实验9的完成;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

DATA ENDS

CODE SEGMENT
	ASSUME CS:CODE,DS:DATA
START:
    MOV AX,DATA
    MOV DS,AX
	

    MOV AH,4CH
    INT 21H
CODE ENDS
  END START





DELAY2 PROC
	PUSH BX
	PUSH CX
	MOV CX,0FH
LL1:MOV BX,0FH
LL2:DEC BX
	JNZ LL2
	LOOP LL1
	POP CX
	POP BX
	RET
DELAY2 ENDP

DELAY PROC
	PUSH BX
	PUSH CX
	MOV CX,0FFH
LLL1:MOV BX,0FFH
LLL2:DEC BX
	JNZ LLL2
	LOOP LLL1
	POP CX
	POP BX
	RET
DELAY ENDP	
;====================================================================================================================;
;;;;功    能：    8255的  A口  从开关K0-K7输入，  B口  显示那个开关按下，灯亮还是灭
;;;;输入：     8255的  A口  从开关K0-K7输入
;;;;输出： 8255的 B口 ，连接相应灯
;;;;芯片地址：    片选为IOY1，    控制口：0646H，    A:0640H,    B:0642H,    C:0644H
;;;;控 制 字：    A口输入，   B口输出，   C口输出       90H

;;;;;;;;;;;;8255    A口输入，   B口输出，   C口输出    ;;;;;;;;;;;;
	MOV AL,90H
	MOV DX,8255_con
	OUT DX,AL
	
   	MOV DX,8255_A
	IN  AL,DX
	
     	MOV DX,8255_B
       	OUT DX,AL
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;=================================================================================================================;
;;;;;;应用：设置中断向量，编写中断服务程序，响应外部中断，并产生相应动作 
;;;;;;功能：初始8255 B 口输出0FFH，红灯绿灯全亮；若KK1按下，产生中断，中断服务程序中 绿灯亮， B 口 输出 0FH，
;;;;;;                                           若KK2按下，产生中断，中断服务程序中 红灯亮， B 口 输出 F0H
;;;;;;输入：开关KK1 --（MIR6） ----- KK2----(MIR7)
;;;;;;输出：8255 B 口 接相应灯
;;;;; 芯片地址：8255 ：IOY1，   KK1连接MIR6，     KK2连接MIR7
;;;;; 8259芯片初始化：------ 设置中断向量-------设置中断服务程序


;;;;;;;;;;;;;;;;;;8259初始化;;;;;;;;;;;;;;;;;;;;;;;
   	
    CLI
    MOV AL,1bH            ;;;;ICW1,高电平触发，单片使用，需要ICW4
    MOV DX,0020H
    OUT DX,AL
    
    MOV AL,0EH            ;;;;ICW2，高5位是相应中断源对应的中断类型码，低三位自动填入中断源；6号中断，-0EH，高5位00001，低三为110
    MOV DX,0021H
    OUT DX,AL
    
    MOV AL,07H            ;;;;ICW4,自动中断结束方式，为8086pentinum CPU
    MOV DX,0021H
    OUT DX,AL
    
    MOV AL,2FH            ;;;;OCW1,哪位为1，屏蔽那个中断源；此中保留4,6,7号，其中4号接串口
    MOV DX,0021H
    OUT DX,AL
    STI


;;;;;;;;;;;;;;;;;;;;8259初始化完成;;;;;;;;;;;;;;


;;;;;;;设置中断向量;;;;;;;;;

    CLI
    MOV AX,0
    MOV ES,AX
    MOV DI,38H                  ;;;;DI为中断类型码（功能调用 0EH）*4对应的矢量地址(段内偏移)38H
    MOV AX,OFFSET INTP6         ;;;;INTP6为中断服务程序，取偏移
    CLD
    STOSW
    MOV AX,SEG INTP6            ;;;;INTP6为中断服务程序，取段地址
    STOSW
    STI
    
    CLI
    MOV AX,0
    MOV ES,AX
    MOV DI,3CH                  ;;;;DI为中断类型码（功能调用 0FH）*4对应的矢量地址(段内偏移)3CH
    MOV AX,OFFSET INTP7         ;;;;INTP6为中断服务程序，取偏移
    CLD 
    STOSW
    MOV AX,SEG INTP7            ;;;;INTP6为中断服务程序，取段地址
    STOSW
    STI

;;;;;;;中断向量设置完成;;;;;;;; ;;;<死循环，等待中断>


;;;;;;;INTP6中断服务程序;;;;;;;;	   

INTP6 PROC FAR
     PUSH AX
     PUSH DX
     PUSH DS
     PUSH CS
     POP DS

    MOV CX,0FFH
 CON: 
    MOV BX,0FFFH;
    
 LL : 
 	MOV AL,0FH
        MOV DX,0642H
   	OUT DX,AL
   	DEC BX;
    JNZ LL;
    LOOP CON

   POP DS
   POP DX
   POP AX
 
   IRET
INTP6 ENDP

;;;;;;;INTP6中断服务程序结束;;;;;;;;

;;;;;;;INTP7中断服务程序;;;;;;;;

 INTP7 PROC FAR
	PUSH AX
	PUSH DX
	PUSH DS
	PUSH CS
	POP DS



    MOV CX,0FFH
 CON2: 
    MOV BX,0FFFH;
    
 LL2 : 
 	MOV AL,0F0H
    MOV DX,0642H
   	OUT DX,AL
   	DEC BX;
    JNZ LL2;
    LOOP CON2

 	POP DS
 	POP DX
 	POP AX
 
 	IRET
 INTP7 ENDP

;;;;;;;INTP7中断服务程序结束;;;;;;;;

;===================================================8255=================================================================;
;;;;;;;;应用：模拟电压量---转为---数字量
;;;;;;;;功能：将0-5V电压转换为数字量，并通过8位LED显示；
;;;;;;;;输入：0809  0通道输入
;;;;;;;;输出：8255 B 口输出，连到LED上
;;;;;;;;芯片地址：0809： IOY1  控制口 A 口 ：0640H     8255 :IOY2     控制口 ：0686H   A 口： 0680H,   B 口： 0682H  C 口： 0684H
;;;;;;;;    0809 就一个口  从此口输入控制字  也从此口 读取转换结果


;;;;;;;;;0809初始化;;;;;;;;;;;
        MOV AL,00H             ;;;;;;;启动0通道
	MOV DX,0640H           ;;;;;;;送控制字
	OUT DX,AL

;;;;;;;;;0809初始化完成;;;;;;;;;;;


;;;;;;;;0809读取转换结果;;;;;;;;

	MOV DX,0640H	
	IN AL,DX

;;;;;;;;0809转换结果读取完成;;;;;;;;

;===================================================================================================================;
;;;;;;;;;;;应用：产生控制信号，数字量变模拟量输出
;;;;;;;;;;;功能：数字量编程，转换产生模拟量，（再通过A/D转成数字量，在示波器上显示）----里面不需设置，就产生模拟量即可
;;;;;;;;;;;芯片地址：0832 （D/A）：IOY0  （0600H---063FH）           0809(A/D) : IOY3 (06C0H----06FFH)
;;;;;;;;;;;0832就一个地址----

;;;;;;;;;0832数字量00H控制输出0V;;;;;;;;;;
	
 	MOV AL,00H
 	MOV DX,0600H
 	OUT DX,AL
;;;;;;;;;0832数字量00H控制输出0V完成;;;;;;;;;;
 	
 	CALL DELAY
 
;;;;;;;;;0832数字量0FFH控制输出5V;;;;;;;;;
	
 	MOV AL,0FFH
 	MOV DX,0600H
 	OUT DX,AL

;;;;;;;;;0832数字量0FFH控制输出5V完成;;;;;;;;; 

;================================================================================================================;


;;;;;;;;;;应用：8254级联 ，产生1s方波
;;;;;;;;;;功能：计数器1，分别工作在方式0（软件，一次）,1（硬件，多次）,3（软硬，重复）
;;;;;;;;;;芯片地址： 8254 ：IOY0    (三个计数器 ，最后是控制字)   0809:   IOY3
;;;;;;;;;;先送控制字，再送计数值


;;;;;;;;;;;;;;;;;8254初始化产生1s方波;;;;;;;;;;;;;;;;;;;;;
	
	MOV AL,36H             ;;;;;计数器0，先低后高，方式3，二进制计数
	MOV DX,0606H
	OUT DX,AL
	
	
	
	MOV AX,1000           ;计数值1000
	MOV DX,0600H
	OUT DX,AL
	MOV AL,AH
	OUT DX,AL
	
 	MOV AL,76H            ;;;;;计数器1，先低后高，方式3，二进制计数
	MOV DX,0606H
	OUT DX,AL
	

	
	MOV AX,1000           ;;;计数值1000
	MOV DX,0602H
	OUT DX,AL
	MOV AL,AH
	OUT DX,AL

;;;;;;;;;;;;;;;;;8254初始化产生1s方波完成;;;;;;;;;;;;;;;;;;;;;

;=================================================================================================================;

;;;;;;;;;;;;;;应用：串行通信;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;功能：将3000H起始的10个单元的数据发送到串口，后接收并保存到4000H开始的内存单元中
;;;;;;;;;;;;;;芯片地址： 8251  ： IOY0   ,        8254 : IOY3
;;;;;;;;;;;;;;   8251 的 0600H是数据口  ，，，，0602H是控制口



;;;;;;;;;;;;;;;;;;;;;;;;;8254初始化;;;;;;;;;;;;;;;;;;;;;;;;;;
		
		MOV AL,0B7H                   ;控制字,计数器2，先低后高，方式3，十进制
		MOV DX,06C6H
		OUT DX,AL

		MOV AX,12                     ;计数值
		MOV DX,06C4H
		OUT DX,AL
		MOV AL,AH
		OUT DX,AL
;;;;;;;;;;;;;;;;;;;;;;;;;8254初始化完成;;;;;;;;;;;;;;;;;;;;;;;;;;	



 
;;;;;;;;;;;;;;;;;;;;;;;;8251初始化;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		
		MOV AL, 00H				
		MOV DX, 0602H
		OUT DX, AL
		CALL DELAY
		OUT DX, AL
		CALL DELAY
		OUT DX, AL
		CALL DELAY
		MOV AL, 40H                          ;;;;;;;复位8251
		OUT DX, AL
		CALL DELAY	

		
		MOV AL,7EH                            ;;;;;方式控制字,1位停止位，偶校验，字符长度8位，异步，波特率系数16
		MOV DX,0602H
		OUT DX,AL
	
		CALL DELAY
		MOV AL,37H                           ;;;;;;命令字,请求发送，错误标志复位，接受允许，数据终端准备好，发送允许
		MOV DX,0602H
		OUT DX,AL
		CALL DELAY
		
;;;;;;;;;;;;;;;;;;;;;;;;8251初始化完成;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;;;;;;;;;;;;;;;;;;;;;;开始传送SI->DI,10个字节的数据;;;;;;;;;;;;;;;;;;;;;;

     		MOV SI,3000H
		MOV DI,4000H	
		MOV CX,10
		
L1:		CMP CX,0
		JZ  LL4                           ;传送结束，转到LL4

		MOV AL,[SI]
		MOV DX,0600H 
		OUT DX,AL                         ;输出
	 	INC SI
		
LL1:    
		MOV DX,0602H
		IN  AL,DX                        ;读状态字
		AND AL,01H                       ;检测发送就绪
	 	JZ  LL1                          ;未就绪，循环等待	
LL2: 	
		MOV DX,0602H
		IN  AL,DX                       ;读状态字
  		AND AL,02H                      ;检测接收就绪
		JZ  LL2                         ;未就绪，循环等待

		MOV DX,0600H 
                IN  AL,DX                       ;输入
		MOV [DI],AL                     ;放到DI
		INC DI

		MOV DX,0602H
		IN  AL,DX                     ;读状态字
		AND AL,38H                    ;检测有无帧错、溢出错、奇偶错
		JNZ LL3                       ;出错，转LL3
		LOOP L1                       ;传送下一字符

LL3:	       DEC SI
    	       DEC DI
	       JMP L1	


;;;;;;;;;;;;;;;;;;;;;;;;;;;传送完毕;;;;;;;;;;;;;;;;;;;;;;;;;;;;;





;=================================================================================================================;



;;;;;;;;;;;;;;;;;;应用：数码管显示
;;;;;;;;;;;;;;;;;;功能：8255的B口接段码，A口接位选；六位数码管循环从左到右显示移动的0-9；显示稳定的数字“123456”
;;;;;;;;;;;;;;;;;;芯片地址：  8255接  IOY0


;;;;;;;;;;;;;;;;;;;8255初始化;;;;;;;;;;;;;;;;;;;;
	
	MOV AL,81H                     ;A,B输出，C口低四位输入
	MOV DX,0606H
	OUT DX,AL

;;;;;;;;;;;;;;;;;;;8255初始化完成;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;显示000000-999999;;;;;;;;;;;;;;;;;;;;;;;;;	

E1:	MOV BX,0                 ;要显示的数字
	MOV AH,0EFH              ; 位选码
	LEA SI,TABL
	
L1:	MOV AL,[BX+SI]           ;B口送数据
	MOV DX,0602H
	OUT DX,AL
	
	MOV AL,AH                ;A口送位选
	MOV DX,0600H
	OUT DX,AL
	
	CALL DELAY1
	
	ROR AH,1
	CMP AH,0BFH
	JNZ L1                  ;从右到左显示一位数字
	
	INC BX                  ;加一显示
	CMP BX,10
	JNZ L1
	JMP E1

;;;;;;;;;;;;;;;;;;;;;;显示000000-999999完成;;;;;;;;;;;;;;;;;;;;;;;;;



;;;;;;;;;;;;;;;;;;;;显示123456;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	

F1:	MOV BX,1                  ;要显示的数据
	MOV AH,0FEH               ;位选码
	LEA SI,TABL  
	
B1:	MOV AL,[BX+SI]            ;B口送数据
	MOV DX,0602H
	OUT DX,AL
	
	MOV AL,AH		 ;A口送位选码
	MOV DX,0600H 
	OUT DX,AL
	
	CALL DELAY2
	
	INC BX		         ;加一显示
	ROL AH,1
				
	CMP BX,7          
	JNZ B1
	JMP F1

;;;;;;;;;;;;;;;;;;;;显示123456完成;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;;;;;;;;;;;;;;;;;;;;循环显示0123456789;;;;;;;;;;;;;;;;;;;;;;

	MOV BX,0
X4:     MOV AH,0DFH
X1:     MOV AL,[BX+SI]	
	MOV DX,0602H
	OUT DX,AL

	MOV AL,AH
	MOV DX,0600H
	OUT DX,AL

	CALL DELAY1
	INC BX

	CMP BX,10
	JZ X2
	
X5:     ROR AH,1
	CMP AH,7FH
	JZ  X4

	JMP X1
X2:  
        MOV BX,0
	JMP X5

;;;;;;;;;;;;;;;;;;;;循环显示0123456789完成;;;;;;;;;;;;;;;;;;;;;;



;=================================================================================================================;


;;;;;;;;;;;;;;;;;;;;;应用：键盘扫描&&数码管移位
;;;;;;;;;;;;;;;;;;;;;功能：初始显示0，初始按下，显示对应的十六进制数字，再次按下，数码管整体移位
;;;;;;;;;;;;;;;;;;;;;芯片地址：   8255： IOY0

;;;;;;;;;;;;;;;;;;;8255初始化;;;;;;;;;;;;;;;;;;;     

      MOV   AL,81H                  ;10000001B;A,B输出，C口低四位输入
      MOV   DX,C8255_CON
      OUT   DX,AL

;;;;;;;;;;;;;;;;;;;8255初始化完成;;;;;;;;;;;;;;;;;;;;

      LEA   SI,NUMBER
      LEA   DI,LEDTAB

X1:   CALL  MDISPLAY   	;显示


;;;;;;;;;;;;;;;;;;键盘扫描查询;;;;;;;;;;;;;;;;;;;;;;;;;;;

X7:   MOV   AL,00H
      MOV   DX,C8255_A
      OUT   DX,AL
      MOV   DX,C8255_C
      IN    AL,DX                   ;从c口读入
      AND   AL,0FH                  ;屏蔽C口高四位
      CMP   AL,0FH
      JZ    X1		            ;无键按下，继续查询

      CALL  DELAY	            ;延时消抖
      CALL  DELAY
      CALL  DELAY

      MOV   BX,0                    ;BX记录键号
      MOV   AH,0FEH	            ;1111 1110逐列扫描
X2:   MOV   AL,AH
      MOV   DX,C8255_A 
      OUT   DX,AL
      MOV   DX,C8255_C
      IN    AL,DX
      AND   AL,0FH
      CMP   AL,0FH
      JNZ   X3		           ;找到按键所在列,此时BX中为按键的列号
      ROL   AH,1	           ;按键不在此列，扫描下一列
      INC   BX	    	           ;列号加一
      CMP   AH,0EFH                ;1110 1111
      JNZ   X2		           ;未扫描完4列
      JMP   X7		           ;重新扫描

X3:   CMP   AL,0EH      ;第0行按下故低电平
      JZ    X4		    ;按键在第0行
      ADD   BX,4	    ;按键在第1行
      CMP   AL,0DH      ;第1行按下故低电平
      JZ    X4		    ;按键在第1行
      ADD   BX,4	    ;按键在第2行
      CMP   AL,0BH      ;第2行按下故低电平
      JZ    X4		    ;按键在第2行
      ADD   BX,4	    ;按键在第3行
      CMP   AL,07H      ;第3行按下故低电平
      JZ    X4	    	;按键在第3行
      
;;;;;;;;;;;;;;;;;;;;键盘扫描结束，BX为按键值;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;数码管显示缓冲区整体右移，窜出一个位置给新安下的键值;;;;;;;;;;;;;;;;;;

X4:   MOV   BP,5
X5:   MOV   AL,DS:[SI+BP-1]        ;将按键存入NUMBER内存区，新按键在小地址
      MOV   DS:[SI+BP],AL
      DEC   BP
      JNZ   X5


      MOV   AL,DS:[DI+BX]
      MOV   DS:[SI],AL	          ;将新按键存入小地址

;;;;;;;;;;;;;;;;;;;数码管显示缓冲区整体右移，窜出一个位置给新安下的键值完成;;;;;;;;;;;;;;;;;;


;;;;;;;;;;;;;;;;;;;;解决一个键子按下却未松开的情况;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

X6:   CALL  MDISPLAY	       ;显示

      MOV   AL,0                      ;按键时间略长时不视为新数，而显示旧数
      MOV   DX,C8255_A
      OUT   DX,AL
      MOV   DX,C8255_C
      IN    AL,DX
      AND   AL,0FH
      CMP   AL,0FH
      JNZ   X6
      JMP   X7                        ;X7为键盘扫描开始

;;;;;;;;;;;;;;;;;;;;解决一个键子按下却未松开的情况完成;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

MDISPLAY  PROC
      PUSH  AX
      PUSH  BX
      PUSH  CX

;;;;;;;;;;;;;;;;;;数码管将数码管缓冲区里的值一个一个显示出来;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

      MOV   BX,0
      MOV   AH,0DFH            ;1011 1111B   
Z1:   MOV   AL,AH
      MOV   DX,C8255_A
      OUT   DX,AL 
           
      MOV   AL,DS:[SI+BX]	   ;取数的段码
      MOV   DX,C8255_B
      OUT   DX,AL	           ;送段选码，b口
      ROR   AH,1 
      INC   BX
 
       MOV   CX,30H
Z2:
       LOOP  Z2

       MOV   AL,00H
       MOV   DX,C8255_B 
       OUT   DX,AL                ;消影

       CMP   AH,07FH             ;  01111111B
       JNZ   Z1

;;;;;;;;;;;;;;;;;;数码管将数码管缓冲区里的值一个一个显示出来完成;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;=================================================================================================================